In [1]:
import pandas as pd

In [2]:
dataset = pd.read_csv('G:\Meu Drive\My Laboratory\Jupyter Lab\databases\datasets\\db.csv', encoding = 'UTF-8', sep = ';', usecols = ['Ano', 'Nome', 'Valor'], nrows = 120)

In [3]:
dataset

                        Nome   Ano      Valor
0              Jetta Variant  2003   88078.64
1                     Passat  1991  106161.94
2                   Crossfox  1990   72832.16
3                        DS5  2019  124549.07
4           Aston Martin DB4  2006   92612.10
..                       ...   ...        ...
115  Aston Martin V8 Vantage  2017  139661.48
116              Z4 Roadster  2019   80382.24
117    Lamborghini Ferruccio  2019  149157.17
118                 Ford Ka+  2006   87830.41
119            Silver Shadow  2015  143568.22

[120 rows x 3 columns]

In [55]:
dataset.shape

(10, 3)

In [96]:
df = pd.read_excel('df.xlsx', sheet_name = 'Ab2')

In [98]:
sheet = pd.ExcelFile('df.xlsx')

In [100]:
sheet.sheet_names

['Planilha1', 'Ab2']